node {
  name: "Placeholder"
  op: "Placeholder"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 75
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 75
        }
      }
    }
  }
}
node {
  name: "Placeholder_1"
  op: "Placeholder"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 75
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 75
        }
      }
    }
  }
}
node {
  name: "fifo_queue"
  op: "FIFOQueueV2"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 512
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_INT64
        type: DT_INT64
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
          dim {
            size: 75
          }
        }
        shape {
          dim {
            size: 75
          }
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "fifo_queue_EnqueueMany"
  op: "QueueEnqueueManyV2"
  input: "fifo_queue"
  input: "Placeholder"
  input: "Placeholder_1"
  device: "/device:CPU:0"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_INT64
        type: DT_INT64
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "fifo_queue_Close"
  op: "QueueCloseV2"
  input: "fifo_queue"
  device: "/device:CPU:0"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1341
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 1341
          }
        }
        string_val: "./downloads/datasets/market1501/bounding_box_test/0031_c1s1_002576_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0031_c1s1_002601_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0031_c2s1_001876_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0031_c4s1_002476_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0031_c4s1_002501_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0031_c4s1_002501_05.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c1s1_003226_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c1s1_004376_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c1s1_004401_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c2s1_002551_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c2s1_002651_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c2s1_003776_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c2s1_003826_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c2s1_003901_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c3s1_002851_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c3s1_002876_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c3s1_003401_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c3s1_003576_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c3s1_003851_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c5s1_003151_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c5s1_003201_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c5s1_004401_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c6s1_003451_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c6s1_003476_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c6s1_003501_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c6s1_003526_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c6s1_003551_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c6s1_003576_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c6s1_003601_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c6s1_003751_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c6s1_003801_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c6s1_003826_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c6s1_003851_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c6s1_003851_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c6s1_003876_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c6s1_003901_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c6s1_003926_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c6s1_004051_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c6s1_004076_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0036_c6s1_004101_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0044_c1s1_004626_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0044_c1s1_004676_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0044_c2s1_003901_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0044_c2s1_003976_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0044_c3s1_003926_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0044_c3s1_004226_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0044_c3s1_004251_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0044_c4s1_004876_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0044_c4s1_005026_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0044_c5s1_004426_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0044_c5s1_004651_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0044_c5s1_004701_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0044_c5s1_004926_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0102_c2s1_017176_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0102_c4s1_017301_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0109_c1s1_035276_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0109_c1s1_035301_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0109_c1s1_035326_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0109_c2s1_018001_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0109_c2s1_018026_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0109_c3s1_018226_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0109_c3s1_018326_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0109_c3s1_034476_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0109_c3s1_034501_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0109_c4s1_035126_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0109_c4s1_035151_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0109_c5s1_035176_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0109_c5s1_035201_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0109_c5s1_035226_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0109_c5s1_035276_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0109_c6s1_018901_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0109_c6s1_035001_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0109_c6s1_035076_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0109_c6s1_035101_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c1s1_030126_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c1s1_030151_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c1s1_030851_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c1s1_030926_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c1s5_017061_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c1s5_017161_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c1s5_017211_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c1s5_059241_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c2s1_029451_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c2s2_149727_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c2s3_026607_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c3s1_029376_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c3s2_152419_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c3s2_152444_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c3s3_032928_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c3s3_032928_12.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c3s3_033028_07.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c3s3_033053_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c4s1_030201_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c4s1_030726_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c4s1_030751_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c4s5_016354_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c4s5_016404_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c5s2_152899_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c5s2_152924_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c5s3_033715_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c5s3_033715_14.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c5s3_033740_06.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0161_c6s3_056792_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c1s1_053276_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c1s1_053401_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c1s1_053626_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c2s1_053051_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c2s1_053051_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c2s1_053176_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c2s1_070571_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c2s1_070671_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c3s1_030651_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c3s1_031151_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c3s1_031176_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c3s1_031301_05.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c3s1_031326_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c3s1_031451_06.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c3s1_032426_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c3s1_032426_06.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c3s1_052576_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c3s1_052726_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c3s1_097992_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c5s1_053276_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c5s1_053326_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c5s1_053376_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c5s1_053401_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c5s1_053701_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c5s1_053701_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c5s1_053726_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c5s1_053726_05.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c5s1_071123_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c5s1_098323_06.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c5s1_098348_07.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c5s1_098398_05.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c5s1_098423_05.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c5s1_098523_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c6s1_031026_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c6s1_031226_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c6s1_031851_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c6s1_052901_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c6s1_052976_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c6s1_053001_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c6s1_053026_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c6s1_053076_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0174_c6s1_053176_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c1s1_039701_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c1s1_039801_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c1s2_002641_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c1s2_002716_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c1s2_002766_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c1s2_019491_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c2s1_038676_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c2s1_038751_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c2s1_038751_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c2s1_038776_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c2s1_038776_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c2s1_039176_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c2s1_039176_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c2s1_075021_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c2s1_075046_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c2s1_091821_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c3s1_039426_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c3s1_039451_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c3s1_074667_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c3s1_074692_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c3s1_092042_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c5s1_039726_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c5s1_039776_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c5s1_039776_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c5s1_039851_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c5s1_039901_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c5s1_075373_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c5s1_075523_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c5s1_092348_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c6s1_039951_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c6s1_039976_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c6s1_040026_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c6s1_040051_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c6s1_075126_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c6s1_075151_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c6s1_075176_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c6s1_075201_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0198_c6s1_075226_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c1s1_042176_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c1s1_045276_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c1s1_045426_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c1s2_019566_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c1s2_047821_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c2s1_045176_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c2s1_045276_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c2s1_091696_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c3s1_044751_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c3s1_091992_05.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c3s1_092092_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c4s1_041401_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c4s1_041626_06.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c4s2_019992_06.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c4s2_020067_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c4s2_020067_07.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c4s2_047448_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c4s2_047448_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c4s2_047473_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c5s1_042126_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c5s1_042151_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c5s1_042176_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c5s1_042301_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c5s1_042526_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c5s1_043076_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c5s1_043151_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c5s1_043526_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c5s1_044826_07.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c5s1_092473_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c5s1_092523_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c5s1_092548_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c5s1_092648_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c5s1_092673_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c5s1_092748_06.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c6s1_043401_05.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c6s1_043776_06.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c6s1_044476_06.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0207_c6s1_045226_05.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0247_c1s1_051526_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0247_c1s1_063556_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0247_c1s1_063656_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0247_c1s1_063681_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0247_c2s1_050951_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0247_c2s1_051026_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0247_c2s1_063146_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0247_c2s1_063171_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0247_c3s1_051201_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0247_c3s1_051226_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0247_c3s1_062867_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0247_c3s1_062917_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0247_c5s1_063498_05.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0247_c5s1_063548_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0247_c5s1_063573_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0247_c5s1_063723_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0247_c5s1_063723_05.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0247_c6s1_051776_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0247_c6s1_051801_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0247_c6s1_051826_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0247_c6s1_063326_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0247_c6s1_063351_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0247_c6s1_063401_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0247_c6s1_063426_05.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0247_c6s1_063451_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0252_c1s1_052726_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0252_c1s1_052801_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0252_c1s1_058406_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0252_c1s1_058481_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0252_c3s1_052226_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0252_c3s1_052276_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0252_c3s1_057767_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0252_c3s1_057842_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0252_c5s1_052626_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0252_c5s1_052726_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0252_c5s1_052801_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0252_c5s1_058423_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0252_c5s1_058448_06.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0252_c5s1_058723_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0252_c6s1_052776_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0252_c6s1_052801_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0252_c6s1_052826_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0252_c6s1_052851_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0252_c6s1_052876_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0252_c6s1_058226_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0252_c6s1_058251_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0252_c6s1_058276_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0252_c6s1_058301_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0252_c6s1_058301_05.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0252_c6s1_058326_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0252_c6s1_058351_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0257_c1s1_054651_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0257_c1s1_054676_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0257_c1s1_065706_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0257_c2s1_054026_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0257_c2s1_054026_06.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0257_c2s1_054151_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0257_c2s1_065146_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0257_c3s1_054051_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0257_c3s1_054326_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0257_c3s1_064892_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0257_c5s1_054576_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0257_c5s1_054701_05.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0257_c5s1_065698_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0257_c6s1_054901_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0257_c6s1_054926_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0257_c6s1_054951_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0257_c6s1_065401_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0257_c6s1_065426_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0262_c1s1_053251_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0262_c1s1_053276_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0262_c1s5_019311_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0262_c1s5_019336_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0262_c1s6_008316_05.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0262_c1s6_008366_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0262_c2s1_052526_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0262_c2s2_151702_08.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0262_c2s2_151852_08.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0262_c2s3_050607_07.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0262_c3s2_154519_05.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0262_c3s2_154544_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0262_c3s2_154569_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0262_c3s3_057078_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0262_c3s3_057103_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0262_c3s3_057253_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0262_c4s1_053926_05.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0262_c4s1_054026_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0262_c4s1_054076_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0262_c4s6_008910_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0262_c5s3_057615_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0262_c5s3_057890_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0262_c5s3_057940_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0262_c6s3_016392_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0262_c6s3_016417_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c1s1_056206_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c1s1_056331_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c1s1_063306_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c1s1_063356_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c3s1_055767_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c3s1_055817_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c3s1_062642_05.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c3s1_062667_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c3s1_062717_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c5s1_056323_06.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c5s1_063248_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c6s1_056276_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c6s1_056301_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c6s1_056301_05.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c6s1_056326_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c6s1_056351_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c6s1_056376_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c6s1_056401_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c6s1_056426_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c6s1_056451_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c6s1_056476_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c6s1_063101_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c6s1_063126_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c6s1_063151_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c6s1_063176_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c6s1_063201_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c6s1_063226_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0265_c6s1_063276_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0291_c2s3_073677_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0291_c2s3_073727_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0291_c3s3_079969_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0291_c3s3_079994_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0291_c3s3_080019_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0291_c6s4_006502_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0291_c6s4_006527_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0305_c1s6_016771_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0305_c2s3_059252_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0305_c2s3_059277_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0305_c3s3_065569_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0305_c3s3_065619_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0305_c5s3_065912_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0305_c6s3_089317_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0305_c6s3_089342_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0312_c1s1_070656_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0312_c1s1_070731_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0312_c1s1_072556_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0312_c1s1_072681_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0312_c2s1_070021_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0312_c2s1_072771_07.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0312_c2s1_072771_08.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0312_c3s1_070167_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0312_c3s1_070242_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0312_c3s1_071917_06.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0312_c5s1_070673_05.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0312_c5s1_070698_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0312_c5s1_070748_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0312_c5s1_072573_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0312_c5s1_072623_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0312_c5s1_072673_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0312_c6s1_070801_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0312_c6s1_070826_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0312_c6s1_072351_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0312_c6s1_072451_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0312_c6s1_072526_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0320_c1s6_032071_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0320_c1s6_032096_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0320_c2s3_074527_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0320_c2s3_074577_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0320_c2s3_074602_05.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0320_c3s3_080819_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0320_c3s3_080869_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0320_c5s3_081212_05.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0320_c5s3_081237_06.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0320_c6s4_007327_05.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0330_c1s2_002941_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0330_c1s2_002966_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0330_c3s1_075317_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0330_c3s1_075367_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0330_c3s1_075417_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0330_c3s1_075442_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0330_c5s1_075698_06.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0330_c5s1_075723_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0330_c5s1_075798_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0330_c5s1_075848_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0330_c5s1_075898_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0330_c5s1_079923_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0330_c5s1_079923_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0330_c6s1_075801_07.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0330_c6s1_075826_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0330_c6s1_075851_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0330_c6s1_076026_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0330_c6s1_076101_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0330_c6s1_076151_06.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0353_c1s2_007791_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0353_c1s2_010891_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0353_c3s1_080192_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0353_c3s1_080192_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0353_c3s1_080267_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0353_c3s1_083067_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0353_c3s1_083092_05.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0353_c3s1_083217_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0353_c5s1_080648_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0353_c5s1_080698_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0353_c5s1_080798_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0353_c5s1_083773_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0353_c5s1_083823_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0353_c6s1_080726_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0353_c6s1_080776_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0353_c6s1_080851_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0353_c6s1_080851_06.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0353_c6s1_080876_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0353_c6s1_083551_06.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0353_c6s1_083626_06.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0353_c6s1_083626_09.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0353_c6s1_083651_07.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0353_c6s1_083676_07.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0355_c3s1_081467_08.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0355_c3s1_081542_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0355_c3s1_081567_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0355_c4s2_008817_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0355_c4s2_008842_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0355_c4s2_008867_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0355_c5s1_081948_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0355_c5s1_081973_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0355_c5s1_082048_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0355_c6s1_082026_05.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0355_c6s1_082051_06.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0355_c6s1_082101_05.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0355_c6s1_082126_05.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0355_c6s1_082201_05.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0381_c1s2_017666_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0381_c1s2_052696_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0381_c1s2_052746_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0381_c3s1_090017_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0381_c3s1_090042_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0381_c3s1_090092_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0381_c3s1_099017_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0381_c3s1_099142_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0381_c3s1_124958_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0381_c3s1_124958_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0381_c3s1_124983_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0381_c3s1_125083_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0381_c3s1_125858_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0381_c5s1_090498_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0381_c5s1_090548_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0381_c5s1_090623_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0381_c5s1_099723_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0381_c5s1_099723_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0381_c5s1_099748_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0381_c5s1_099773_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0381_c5s1_126445_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0396_c1s2_021016_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0396_c1s2_021041_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0396_c1s2_033166_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0396_c2s1_093246_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0396_c2s1_093246_06.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0396_c2s1_093271_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0396_c2s1_093271_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0396_c2s1_105446_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0396_c2s1_105446_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0396_c3s1_093517_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0396_c3s1_093567_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0396_c3s1_105217_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0396_c5s1_106073_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0438_c1s2_056446_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0438_c2s1_106821_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0438_c2s1_106896_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0438_c2s1_128866_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0438_c3s1_107092_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0438_c3s1_107117_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0438_c3s1_128408_03.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0438_c3s1_128433_04.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0473_c1s2_050246_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0473_c1s2_050296_02.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0473_c1s2_057296_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0473_c1s2_057496_01.jpg"
        string_val: "./downloads/datasets/market1501/bounding_box_test/0473_c2s1_122541_02.jpg"
