node {
  name: "Placeholder"
  op: "Placeholder"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 57
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 57
        }
      }
    }
  }
}
node {
  name: "Placeholder_1"
  op: "Placeholder"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 57
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 57
        }
      }
    }
  }
}
node {
  name: "fifo_queue"
  op: "FIFOQueueV2"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 512
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_INT64
        type: DT_INT64
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
          dim {
            size: 57
          }
        }
        shape {
          dim {
            size: 57
          }
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "fifo_queue_EnqueueMany"
  op: "QueueEnqueueManyV2"
  input: "fifo_queue"
  input: "Placeholder"
  input: "Placeholder_1"
  device: "/device:CPU:0"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_INT64
        type: DT_INT64
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "fifo_queue_Close"
  op: "QueueCloseV2"
  input: "fifo_queue"
  device: "/device:CPU:0"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3876
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 3876
          }
        }
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c001_00031230_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c001_00031235_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c001_00031240_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c001_00031245_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c001_00031250_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c001_00031255_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c002_00031550_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c002_00031560_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c002_00031570_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c002_00031580_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c002_00031590_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c002_00031610_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c003_00034395_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c003_00034405_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c003_00034415_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c003_00034425_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c003_00034435_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c003_00034470_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c004_00034295_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c004_00034310_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c004_00034325_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c004_00034380_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c006_00033705_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c006_00033745_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c006_00033770_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c006_00033790_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c006_00033805_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c006_00033815_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c010_00033900_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c010_00033905_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c010_00033910_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c010_00033915_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c010_00033920_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c010_00033925_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c011_00033715_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c011_00033725_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c011_00033735_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c011_00033745_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c011_00033755_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c011_00033765_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c012_00033775_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c012_00033780_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c012_00033790_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c012_00033795_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c012_00033800_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c012_00033805_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c013_00030970_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c013_00030975_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c013_00030990_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c013_00031000_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c013_00031010_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c013_00031030_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c014_00029480_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c014_00029490_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c014_00029510_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c014_00029515_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c014_00029520_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c014_00029525_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c015_00029520_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c015_00029525_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c015_00029530_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c015_00029535_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c015_00029540_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c015_00029545_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c016_00029195_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c016_00029200_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c016_00029205_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c016_00029210_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c016_00029215_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c016_00029220_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c017_00030335_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c017_00030345_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c017_00030350_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c017_00030360_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c017_00030385_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c017_00030400_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c019_00030185_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c019_00030195_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c019_00030200_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c019_00030205_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c019_00030210_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0017_c019_00030215_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c001_00004645_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c001_00004650_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c001_00004655_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c001_00004660_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c001_00004665_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c001_00004670_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c002_00003060_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c002_00003070_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c002_00003080_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c002_00003090_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c002_00003100_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c002_00003110_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c003_00000710_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c003_00000725_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c003_00000735_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c003_00000740_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c003_00000745_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c003_00000750_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c004_00000605_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c004_00000610_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c004_00000615_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c004_00000620_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c004_00000625_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c004_00000630_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c006_00001180_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c006_00001195_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c006_00001200_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c006_00001205_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c006_00001215_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c006_00001225_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c008_00000505_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c008_00000515_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c008_00000520_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c008_00000525_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c008_00000535_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c009_00000535_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c009_00000545_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c009_00000555_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c009_00000565_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c009_00000575_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c009_00000580_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c010_00001140_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c010_00001145_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c010_00001150_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c010_00001155_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c010_00001160_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c010_00001165_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c011_00001135_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c011_00001145_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c011_00001150_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c011_00001155_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c011_00001160_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c011_00001175_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c012_00005285_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c012_00005290_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c012_00005295_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c012_00005300_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c012_00005305_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c012_00005310_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c013_00005120_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c013_00005130_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c013_00005145_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c014_00008105_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c014_00008110_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c014_00008115_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c014_00008120_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c015_00007995_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c015_00008000_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c015_00008005_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c015_00008010_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c015_00008015_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c015_00008020_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c016_00008250_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c016_00008255_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c016_00008260_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c017_00007495_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c017_00007505_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c017_00007510_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c017_00007515_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c017_00007520_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c017_00007530_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c019_00007620_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c019_00007625_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c019_00007630_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c019_00007635_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c019_00007645_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0039_c019_00007650_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c002_00038550_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c002_00038560_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c002_00038570_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c002_00038580_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c002_00038590_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c002_00038610_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c003_00035960_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c003_00035970_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c003_00035980_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c003_00035985_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c003_00035995_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c003_00036000_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c004_00035875_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c004_00035880_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c004_00035885_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c004_00035890_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c004_00035895_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c004_00035900_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c006_00036600_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c006_00036620_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c006_00036625_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c006_00036635_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c006_00036660_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c006_00036675_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c008_00035690_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c008_00035715_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c008_00035725_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c008_00035735_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c008_00035740_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c009_00035780_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c009_00035785_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c009_00035790_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c009_00035795_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c009_00035800_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c009_00035805_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c010_00036515_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c010_00036525_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c010_00036535_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c010_00036545_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c010_00036555_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c010_00036565_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c011_00036575_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c011_00036585_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c011_00036595_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c011_00036605_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c011_00036615_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0078_c011_00036625_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0082_c001_00028980_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0082_c001_00028990_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0082_c001_00029000_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0082_c001_00029010_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0082_c002_00029295_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0082_c002_00029305_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0082_c002_00029315_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0082_c002_00029325_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0082_c002_00029335_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0082_c002_00029345_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0082_c013_00028675_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0082_c013_00028685_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0082_c013_00028695_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0082_c013_00028705_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0082_c013_00028720_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0082_c017_00027595_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0082_c017_00027610_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0082_c017_00027710_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0082_c017_00027740_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0082_c017_00027770_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0082_c017_00027805_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c001_00002570_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c001_00002580_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c001_00002590_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c001_00002600_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c001_00002610_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c001_00002615_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c012_00002235_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c012_00002240_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c012_00002245_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c012_00002250_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c012_00002255_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c012_00002260_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c013_00002315_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c013_00002325_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c013_00002335_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c013_00002345_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c013_00002355_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c013_00002365_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c014_00000765_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c014_00000770_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c014_00000830_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c014_00000845_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c014_00000860_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c014_00000875_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c015_00000955_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c015_00000960_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c015_00000965_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c015_00000975_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c015_00000980_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c015_00000990_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c016_00000570_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c016_00000575_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c016_00000580_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c016_00000590_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c016_00000595_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c016_00000600_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c017_00001695_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c017_00001715_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c017_00001735_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c017_00001745_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c017_00001755_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c019_00001585_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c019_00001590_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c019_00001595_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c019_00001600_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c019_00001605_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0087_c019_00001610_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c003_00015475_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c003_00015485_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c003_00015505_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c003_00015520_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c003_00015565_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c003_00015575_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c005_00083330_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c005_00083340_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c005_00083355_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c005_00083370_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c005_00083380_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c005_00083390_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c007_00083435_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c007_00083440_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c007_00083450_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c007_00083460_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c007_00083470_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c007_00083475_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c008_00082595_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c008_00082600_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c008_00082605_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c008_00082610_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c008_00082615_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c009_00082535_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c009_00082540_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c009_00082545_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c009_00082550_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c009_00082555_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0097_c009_00082560_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c001_00024790_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c001_00024800_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c001_00024810_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c001_00024820_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c001_00024830_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c001_00024840_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c012_00025220_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c012_00025225_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c012_00025235_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c012_00025240_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c012_00025245_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c012_00025250_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c013_00025075_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c013_00025090_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c013_00025105_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c013_00025110_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c014_00026755_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c014_00026760_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c014_00026765_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c014_00026770_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c014_00026775_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c014_00026780_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c015_00026585_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c015_00026590_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c015_00026595_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c015_00026600_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c015_00026605_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c015_00026620_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c016_00027045_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c016_00027050_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c016_00027055_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c016_00027060_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c017_00025790_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c017_00025800_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c017_00025810_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c017_00025820_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c017_00025830_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c017_00025840_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c019_00025985_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c019_00025995_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c019_00026005_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c019_00026010_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c019_00026015_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0098_c019_00026020_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c003_00017925_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c003_00017935_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c003_00017945_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c003_00017955_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c003_00017965_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c003_00017975_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c004_00017900_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c004_00017910_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c004_00017920_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c004_00017930_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c004_00017940_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c004_00017955_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c005_00018965_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c005_00018980_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c005_00019000_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c005_00019020_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c005_00019045_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c005_00019060_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c006_00010575_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c006_00010600_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c006_00010625_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c006_00010640_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c006_00010655_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c006_00010680_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c008_00018295_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c008_00018300_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c008_00018305_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c008_00018310_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c008_00018315_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c009_00018165_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c009_00018170_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c009_00018175_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c009_00018180_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c009_00018185_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c009_00018190_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c010_00010775_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c010_00010780_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c010_00010790_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c010_00010795_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c010_00010800_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c011_00010525_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c011_00010535_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c011_00010545_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c011_00010555_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c011_00010565_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c011_00010590_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c016_00055875_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c016_00055880_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c016_00055885_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0121_c016_00055890_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c001_00059500_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c001_00059510_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c001_00059520_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c001_00059530_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c001_00059550_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c001_00059560_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c002_00060550_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c002_00060565_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c002_00060585_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c002_00060600_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c002_00060620_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c002_00060655_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c002_00068110_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c002_00068135_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c002_00068195_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c002_00068230_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c002_00068240_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c002_00068250_1.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c012_00057520_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c012_00057535_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c012_00057550_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c012_00057565_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c012_00057575_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c012_00057585_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c013_00057680_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c013_00057685_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c013_00057690_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c013_00057695_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c013_00057700_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c013_00057705_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c014_00055515_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c014_00055540_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c014_00055565_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c014_00055590_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c014_00055630_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c014_00055635_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c015_00055790_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c015_00055795_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c015_00055800_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c015_00055805_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c015_00055810_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c015_00055815_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c016_00055305_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c016_00055310_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c016_00055315_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c017_00056880_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c017_00056885_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c017_00056890_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c017_00056895_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c017_00056905_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c017_00056915_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c019_00056680_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c019_00056685_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c019_00056690_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c019_00056695_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c019_00056700_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0157_c019_00056715_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c001_00045245_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c001_00045255_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c001_00045265_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c001_00045270_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c001_00045275_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c001_00045280_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c001_00055115_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c001_00055125_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c001_00055160_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c001_00055200_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c001_00055205_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c001_00055215_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c002_00045825_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c002_00045835_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c002_00045845_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c002_00045855_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c002_00045865_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c002_00045875_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c002_00053930_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c002_00053945_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c002_00053960_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c002_00053975_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c002_00053990_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c002_00054010_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c012_00044215_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c012_00044220_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c012_00044225_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c012_00044230_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c012_00044240_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c012_00044245_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c012_00055805_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c012_00055810_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c012_00055815_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c012_00055825_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c012_00055835_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c012_00055845_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c013_00055645_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c013_00055650_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c013_00055655_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c013_00055660_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c013_00055665_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c013_00055670_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c014_00042615_0.jpg"
        string_val: "./downloads/datasets/veri_resized/image_train/0170_c014_00042620_0.jpg"
